// 多次元配列の使い方。

using System;

public class Lesson05
{
    public static void Main()
    {
        //4次元配列です。3次元配列を格納してるはずです。
        int[][][][] enemyImage = {
            //3次元配列です。2次元配列を格納してます。
        new int[][][] {
            //2次元配列です。1次元配列を格納をしてます。
            new int[][] {
                //1次元配列です。要素を格納してます。
                new int[] {0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0},
                new int[] {1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1},
                new int[] {1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1},
                new int[] {1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1},
                new int[] {0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0},
                new int[] {0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0},
                new int[] {0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0}
            },
            new int[][] {
                new int[] {0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0},
                new int[] {1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1},
                new int[] {1, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1},
                new int[] {1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1},
                new int[] {0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0},
                new int[] {0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0},
                new int[] {0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1}
            },
            new int[][] {
                new int[] {0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0},
                new int[] {1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1},
                new int[] {1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1},
                new int[] {1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1},
                new int[] {0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0},
                new int[] {0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0},
                new int[] {1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0}
            }
        }
        };

        //いや、このコードは4次元配列中の3次元配列の添字[0]を、
        //指定したつもりだったけど、実行結果は、
        //3次元配列中の要素だった。
        //つまり、
        //foreach (int[][] line in enemyImage[0])とは、
        //enemyImage配列中の"0"番目に格納されている’配列’の’要素’を排出するということ。
        foreach (int[][] line in enemyImage[0])
        {
            Console.WriteLine(line);
        }
        //実行結果..
        //System.Int32[][]
        //System.Int32[][]
        //System.Int32[][]

        Console.WriteLine();

        foreach (int[][][] doc in enemyImage)
        {
            Console.WriteLine(doc);
        }
        //実行結果..
        //System.Int32[][][]

    }
}
